---
kind: method
id: M:Autodesk.Revit.DB.StructuralAsset.Dispose
source: html/e1f5b298-c7a3-1276-d5ea-70d968f2e71a.htm
---
# Autodesk.Revit.DB.StructuralAsset.Dispose Method

Releases all resources used by the StructuralAsset

## Syntax (C#)
```csharp
public void Dispose()
```